package com.MGrigorovich.lemon.lesson2;

/*
Напишите программу, которая определит число четное или не четное.

@author MGrigorovich
@version 0.01
*/
public class Chet {
    public static void main(String[] args) {
        int a = 7;
        if (a % 2 == 0) {
            System.out.println("Четное");
        } else {
            System.out.println("Не Четное");
        }
    }
}


